# Advent of Code 2024 Day 1

## Part 1

Sort the 2 columns of numbers and subtract 1 column from the other, then sum the results for the answer.

In [53]:
import pandas as pd

I pasted the lines of numbers into a csv and separated the columns using pandas.

In [54]:
df = pd.read_csv('input-list.csv', sep='   ', header=None, engine='python')
df

         0      1
0    61087  87490
1    31697  16584
2    57649  82503
3    75864  27659
4    27509  96436
..     ...    ...
995  55653  99467
996  16584  91025
997  11460  91094
998  85535  71742
999  85773  24213

[1000 rows x 2 columns]

Write each column to its own series and sort the values

In [55]:
series_1 = df[0].sort_values().reset_index(drop=True)
print(series_1)

0      10103
1      10118
2      10352
3      10362
4      10543
       ...
995    99830
996    99845
997    99892
998    99897
999    99986
Name: 0, Length: 1000, dtype: int64

In [56]:
series_2 = df[1].sort_values().reset_index(drop=True)
print(series_2)

0      10278
1      10655
2      10693
3      10754
4      11281
       ...
995    99467
996    99467
997    99467
998    99867
999    99903
Name: 1, Length: 1000, dtype: int64

Then subtract the series and set the numbers to the absolute value, then sum them.

In [57]:
product_series = series_1.sub(series_2).abs()
product_series
solution = int(product_series.sum())
solution

1258579

## Part 2

Calculate similarity score between series by multiplying each value in series 1 by the number of times it appears in series 2 then summing that list.

I am combining the series back into a dataframe and using the groupby and count operations

In [77]:
df = pd.concat([series_1, series_2], axis=1, keys=['Left', 'Right'])
df

      Left  Right
0    10103  10278
1    10118  10655
2    10352  10693
3    10362  10754
4    10543  11281
..     ...    ...
995  99830  99467
996  99845  99467
997  99892  99467
998  99897  99867
999  99986  99903

[1000 rows x 2 columns]

### Figure out logic
I was struggling to get the correct order of operations for method chaining in this case, so I had to make my own smaller example to figure it out.

In [ ]:
data = {'Left': [2, 4, 6, 5, 10, 15, 20, 32, 42, 50, 100, 31, 7, 18, 17], 'Right': [4, 10, 21, 4, 100, 3, 32, 7, 18, 4, 100, 31, 42, 21, 7 ]}
df_ex = pd.DataFrame(data)
df_ex

    Left  Right
0      2      4
1      4     10
2      6     21
3      5      4
4     10    100
5     15      3
6     20     32
7     32      7
8     42     18
9     50      4
10   100    100
11    31     31
12     7     42
13    18     21
14    17      7

In [ ]:
counts_test = df_ex['Right'].value_counts().reindex(df_ex['Left']).fillna(0).astype(int)
result_df = pd.DataFrame({'Left': counts_test.index, 'Right_Count': counts_test.values})
result_df

    Left  Right_Count
0      2            0
1      4            3
2      6            0
3      5            0
4     10            1
5     15            0
6     20            0
7     32            1
8     42            1
9     50            0
10   100            2
11    31            1
12     7            2
13    18            1
14    17            0

### Back to the Actual Problem

In [79]:
counts = df['Right'].value_counts().reindex(df['Left']).fillna(0).astype(int)
results_df = pd.DataFrame({'Left': counts.index, 'Right_Count': counts.values})
results_df

      Left  Right_Count
0    10103            0
1    10118            0
2    10352            0
3    10362            0
4    10543            0
..     ...          ...
995  99830            0
996  99845            0
997  99892            0
998  99897            0
999  99986            0

[1000 rows x 2 columns]

Multiply Left and Right_Count columns and Sum result

In [ ]:
results_df['Multiplied'] = results_df.Left * results_df.Right_Count
multiplied = results_df.Left * results_df.Right_Count

solution = int(multiplied.sum())
solution

23981443